app/controllers/realised_training_controller.rb

SELECT "realised_trainings".* FROM "realised_trainings"   ORDER BY "realised_trainings"."name" ASC
---
  def index
    @realised_trainings = RealisedTraining.order(:name)

INSERT INTO "realised_trainings" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-09-04 19:13:10.144665"], ["updated_at", "2015-09-04 19:13:10.144665"]]
---
  def create
    @realised_training = RealisedTraining.new

    respond_to do |format|
      if @realised_training.save

DELETE FROM "realised_trainings" WHERE "realised_trainings"."id" = $1  [["id", 5]]
---
  def destroy
    @realised_training.destroy

SELECT  "realised_trainings".* FROM "realised_trainings"  WHERE "realised_trainings"."id" = $1 LIMIT 1  [["id", 5]]
---
    def set_realised_training
      @realised_training = RealisedTraining.find(params[:id])