app/controllers/realised_trainings_controller.rb

SELECT "realised_trainings".* FROM "realised_trainings"   ORDER BY "realised_trainings"."name" ASC
---
  def index
    @realised_trainings = RealisedTraining.order(:name)

INSERT INTO "realised_trainings" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-09-05 17:31:48.861717"], ["updated_at", "2015-09-05 17:31:48.861717"]]
---
  def create
    @realised_training = RealisedTraining.new

    respond_to do |format|
      if @realised_training.save

UPDATE "realised_trainings" SET "date" = $1, "updated_at" = $2 WHERE "realised_trainings"."id" = 4  [["date", "2014-01-09 00:00:00.000000"], ["updated_at", "2015-09-05 17:47:41.598307"]]
---
  def update
    respond_to do |format|
      if @realised_training.update(realised_training_params)

DELETE FROM "realised_trainings" WHERE "realised_trainings"."id" = $1  [["id", 3]]
---
  def destroy
    @realised_training.destroy

SELECT  "realised_trainings".* FROM "realised_trainings"  WHERE "realised_trainings"."id" = $1 LIMIT 1  [["id", 4]]
---
    def set_realised_training
      @realised_training = RealisedTraining.find(params[:id])